---
kind: method
id: M:Autodesk.Revit.UI.UISaveAsOptions.Dispose
source: html/37115b7c-f96c-3d4d-cb35-e70b69336f3b.htm
---
# Autodesk.Revit.UI.UISaveAsOptions.Dispose Method

Releases all resources used by the UISaveAsOptions

## Syntax (C#)
```csharp
public void Dispose()
```